---
kind: property
id: P:Autodesk.Revit.DB.ReferenceArrayArray.Size
source: html/1c021f23-306f-0a8c-ad59-3ccac664be71.htm
---
# Autodesk.Revit.DB.ReferenceArrayArray.Size Property

Returns the number of ReferenceArrays that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```